Билет15/src/Documents/ДопЗатраты/ДопЗатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДопЗатраты</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>РасходнаяНакладная</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Затраты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Билет15/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Продажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет15/src/Documents/ДопЗатраты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Продажи.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДопЗатратыСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(ДопЗатратыСписокНоменклатуры.Затраты) КАК Затраты,
		|	ДопЗатратыСписокНоменклатуры.Ссылка.РасходнаяНакладная КАК РасходнаяНакладная
		|ПОМЕСТИТЬ втТЧТовары
		|ИЗ
		|	Документ.ДопЗатраты.СписокНоменклатуры КАК ДопЗатратыСписокНоменклатуры
		|ГДЕ
		|	ДопЗатратыСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДопЗатратыСписокНоменклатуры.Номенклатура,
		|	ДопЗатратыСписокНоменклатуры.Ссылка.РасходнаяНакладная
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЧТовары.Номенклатура КАК Номенклатура,
		|	втТЧТовары.Затраты КАК Затраты,
		|	Продажижи.Номенклатура КАК Номенклатура1,
		|	ВЫБОР
		|		КОГДА Продажижи.Номенклатура ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьСоответствие,
		|	Продажижи.Период КАК Период,
		|	втТЧТовары.Номенклатура.Представление КАК НоменклатураПредставление
		|ИЗ
		|	втТЧТовары КАК втТЧТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи КАК Продажижи
		|		ПО втТЧТовары.Номенклатура = Продажижи.Номенклатура
		|			И (Продажижи.Регистратор = втТЧТовары.РасходнаяНакладная)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		//если нет соотв номенклатуры из тч с РН продажи по данной расходной накл
		Если НЕ Выборка.Естьсоответствие Тогда
			 Отказ = истина;
		     Сообщение = Новый СообщениеПользователю;
			 Сообщение.Текст = СтрШаблон("в этой накладной нет товара %1.", Выборка.НоменклатураПредставление);
			 Сообщение.Сообщить();
		 КонецЕсли;
		 Если Отказ Тогда
		 	Продолжить;
		 КонецЕсли;
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Выборка.период;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Себестоимость = Выборка.Затраты;
	КонецЦикла;
	
КонецПроцедуры
